Repository: Julian0s/FEEDLOG-new
Catalog: lib/l10n/app_*.arb
Languages: ar, de, fr, hi, it, ja, ko, pt, ru, zh

# chatDailySummaryDefault
source: Here's your daily summary:
ar: إليك ملخصك اليومي:
de: Hier ist deine Tageszusammenfassung:
fr: Voici votre résumé quotidien :
hi: यहां आपका दैनिक सारांश है:
it: Ecco il tuo riepilogo giornaliero:
ja: 本日のまとめです：
ko: 오늘의 요약입니다:
pt: Aqui está seu resumo diário:
ru: Вот твоя дневная сводка:
zh: 这是你的每日摘要：

# chatInputPlaceholder
source: Type your message...
ar: اكتب رسالتك...
de: Nachricht eingeben...
fr: Tapez votre message...
hi: अपना संदेश लिखें...
it: Scrivi il tuo messaggio...
ja: メッセージを入力...
ko: 메시지 입력...
pt: Digite sua mensagem...
ru: Введи сообщение...
zh: 输入你的消息...

# loginTagline
source: Your AI-powered nutrition assistant
ar: مساعدك الغذائي بالذكاء الاصطناعي
de: Dein KI-Ernährungsassistent
fr: Votre assistant nutritionnel IA
hi: आपका AI पोषण सहायक
it: Il tuo assistente nutrizionale IA
ja: あなたのAI栄養アシスタント
ko: AI 영양 도우미
pt: Seu assistente nutricional com IA
ru: Твой ИИ-помощник по питанию
zh: 你的AI营养助手

# loginEmailPlaceholder
source: Email
ar: البريد الإلكتروني
hi: ईमेल
ja: メール
ko: 이메일
zh: 邮箱

# loginPasswordPlaceholder
source: Password
ar: كلمة المرور
de: Passwort
fr: Mot de passe
hi: पासवर्ड
ja: パスワード
ko: 비밀번호
pt: Senha
ru: Пароль
zh: 密码

# loginEmailRequired
source: Please enter your email
ar: أدخل بريدك الإلكتروني
de: Gib deine E-Mail ein
fr: Entrez votre email
hi: अपना ईमेल दर्ज करें
it: Inserisci la tua email
ja: メールを入力してください
ko: 이메일을 입력하세요
pt: Digite seu email
ru: Введи свой email
zh: 请输入你的邮箱

# loginEmailInvalid
source: Invalid email
ar: بريد إلكتروني غير صالح
de: Ungültige E-Mail
fr: Email invalide
hi: अमान्य ईमेल
it: Email non valida
ja: 無効なメール
ko: 유효하지 않은 이메일
pt: Email inválido
ru: Неверный email
zh: 邮箱无效

# loginPasswordRequired
source: Please enter your password
ar: أدخل كلمة المرور
de: Gib dein Passwort ein
fr: Entrez votre mot de passe
hi: अपना पासवर्ड दर्ज करें
it: Inserisci la tua password
ja: パスワードを入力してください
ko: 비밀번호를 입력하세요
pt: Digite sua senha
ru: Введи свой пароль
zh: 请输入你的密码

# loginPasswordLengthError
source: Password must be at least 6 characters
ar: كلمة المرور يجب أن تكون 6 أحرف على الأقل
de: Passwort muss mindestens 6 Zeichen haben
fr: Le mot de passe doit contenir au moins 6 caractères
hi: पासवर्ड कम से कम 6 अक्षर का होना चाहिए
it: La password deve avere almeno 6 caratteri
ja: パスワードは6文字以上必要です
ko: 비밀번호는 최소 6자 이상이어야 합니다
pt: Senha deve ter no mínimo 6 caracteres
ru: Пароль должен быть минимум 6 символов
zh: 密码至少需要6个字符

# loginButton
source: Sign In
ar: تسجيل الدخول
de: Anmelden
fr: Connexion
hi: साइन इन करें
it: Accedi
ja: ログイン
ko: 로그인
pt: Entrar
ru: Войти
zh: 登录

# loginSignupLink
source: Don't have an account? Sign up
ar: ليس لديك حساب؟ سجل
de: Kein Konto? Registrieren
fr: Pas de compte ? Inscrivez-vous
hi: खाता नहीं है? साइन अप करें
it: Non hai un account? Registrati
ja: アカウントをお持ちでないですか？登録
ko: 계정이 없으신가요? 가입
pt: Não tem conta? Cadastre-se
ru: Нет аккаунта? Зарегистрируйся
zh: 没有账户？注册

# signupTitle
source: Create Account
ar: إنشاء حساب
de: Konto Erstellen
fr: Créer un Compte
hi: खाता बनाएं
it: Crea Account
ja: アカウント作成
ko: 계정 만들기
pt: Criar Conta
ru: Создать аккаунт
zh: 创建账户

# signupSubtitle
source: Join FEEDLOG
ar: انضم إلى FEEDLOG
de: FEEDLOG beitreten
fr: Rejoignez FEEDLOG
hi: FEEDLOG में शामिल हों
it: Unisciti a FEEDLOG
ja: FEEDLOGに参加
ko: FEEDLOG 가입
pt: Junte-se ao FEEDLOG
ru: Присоединяйся к FEEDLOG
zh: 加入FEEDLOG

# signupConfirmPasswordPlaceholder
source: Confirm Password
ar: تأكيد كلمة المرور
de: Passwort Bestätigen
fr: Confirmer le Mot de Passe
hi: पासवर्ड की पुष्टि करें
it: Conferma Password
ja: パスワード確認
ko: 비밀번호 확인
pt: Confirmar Senha
ru: Подтвердить пароль
zh: 确认密码

# signupConfirmPasswordRequired
source: Please confirm your password
ar: أكد كلمة المرور
de: Bestätige dein Passwort
fr: Confirmez votre mot de passe
hi: अपने पासवर्ड की पुष्टि करें
it: Conferma la tua password
ja: パスワードを確認してください
ko: 비밀번호를 확인하세요
pt: Confirme sua senha
ru: Подтверди свой пароль
zh: 请确认你的密码

# signupPasswordsMismatch
source: Passwords don't match
ar: كلمات المرور غير متطابقة
de: Passwörter stimmen nicht überein
fr: Les mots de passe ne correspondent pas
hi: पासवर्ड मेल नहीं खाते
it: Le password non corrispondono
ja: パスワードが一致しません
ko: 비밀번호가 일치하지 않습니다
pt: As senhas não coincidem
ru: Пароли не совпадают
zh: 密码不匹配

# signupTermsAcceptance
source: I accept the terms of use and privacy policy
ar: أوافق على شروط الاستخدام وسياسة الخصوصية
de: Ich akzeptiere die Nutzungsbedingungen und Datenschutzrichtlinie
fr: J'accepte les conditions d'utilisation et la politique de confidentialité
hi: मैं उपयोग की शर्तों और गोपनीयता नीति से सहमत हूं
it: Accetto i termini d'uso e la privacy policy
ja: 利用規約とプライバシーポリシーに同意します
ko: 이용약관 및 개인정보 처리방침에 동의합니다
pt: Aceito os termos de uso e política de privacidade
ru: Я принимаю условия использования и политику конфиденциальности
zh: 我接受使用条款和隐私政策

# signupTermsRequired
source: You must accept the terms to continue
ar: يجب قبول الشروط للمتابعة
de: Du musst die Bedingungen akzeptieren um fortzufahren
fr: Vous devez accepter les conditions pour continuer
hi: जारी रखने के लिए आपको शर्तों से सहमत होना होगा
it: Devi accettare i termini per continuare
ja: 続行するには利用規約に同意する必要があります
ko: 계속하려면 약관에 동의해야 합니다
pt: Você deve aceitar os termos para continuar
ru: Для продолжения необходимо принять условия
zh: 你必须接受条款才能继续

# signupButton
source: Create Account
ar: إنشاء حساب
de: Konto Erstellen
fr: Créer un Compte
hi: खाता बनाएं
it: Crea Account
ja: アカウント作成
ko: 계정 만들기
pt: Criar Conta
ru: Создать аккаунт
zh: 创建账户

# signupLoginLink
source: Already have an account? Sign in
ar: لديك حساب بالفعل؟ سجل الدخول
de: Bereits ein Konto? Anmelden
fr: Déjà un compte ? Connectez-vous
hi: पहले से खाता है? साइन इन करें
it: Hai già un account? Accedi
ja: すでにアカウントをお持ちですか？ログイン
ko: 이미 계정이 있으신가요? 로그인
pt: Já tem conta? Faça login
ru: Уже есть аккаунт? Войти
zh: 已有账户？登录

# loadingVerification
source: Verifying login...
ar: جاري التحقق من تسجيل الدخول...
de: Anmeldung wird überprüft...
fr: Vérification de la connexion...
hi: लॉगिन सत्यापित हो रहा है...
it: Verifica accesso...
ja: ログインを確認中...
ko: 로그인 확인 중...
pt: Verificando login...
ru: Проверка входа...
zh: 正在验证登录...

# genderSelectorTitle
source: Select Your Biological Sex
ar: اختر جنسك البيولوجي
de: Wähle Dein Biologisches Geschlecht
fr: Sélectionnez Votre Sexe Biologique
hi: अपना जैविक लिंग चुनें
it: Seleziona il Tuo Sesso Biologico
ja: 生物学的性別を選択
ko: 생물학적 성별 선택
pt: Selecione seu Sexo Biológico
ru: Выбери свой биологический пол
zh: 选择你的生理性别

# genderMale
source: Male
ar: ذكر
de: Männlich
fr: Masculin
hi: पुरुष
it: Maschile
ja: 男性
ko: 남성
pt: Masculino
ru: Мужской
zh: 男性

# genderFemale
source: Female
ar: أنثى
de: Weiblich
fr: Féminin
hi: महिला
it: Femminile
ja: 女性
ko: 여성
pt: Feminino
ru: Женский
zh: 女性

# activitySelectorTitle
source: Physical Activity Level
ar: مستوى النشاط البدني
de: Körperliches Aktivitätsniveau
fr: Niveau d'Activité Physique
hi: शारीरिक गतिविधि स्तर
it: Livello di Attività Fisica
ja: 身体活動レベル
ko: 신체 활동 수준
pt: Nível de Atividade Física
ru: Уровень физической активности
zh: 身体活动水平

# activitySedentary
source: Sedentary
ar: خامل
de: Sitzend
fr: Sédentaire
hi: गतिहीन
it: Sedentario
ja: 座りがち
ko: 앉아있는
pt: Sedentário
ru: Сидячий
zh: 久坐

# activitySedentaryDesc
source: Little or no exercise
ar: قليل أو بدون تمارين
de: Wenig oder kein Sport
fr: Peu ou pas d'exercice
hi: कम या कोई व्यायाम नहीं
it: Poco o nessun esercizio
ja: 運動はほとんどなし
ko: 운동 거의 없음
pt: Pouco ou nenhum exercício
ru: Мало или нет упражнений
zh: 很少或没有运动

# activityLight
source: Light
ar: خفيف
de: Leicht
fr: Léger
hi: हल्का
it: Leggero
ja: 軽度
ko: 가벼운
pt: Leve
ru: Лёгкий
zh: 轻度

# activityLightDesc
source: Light exercise 1-3 days/week
ar: تمارين خفيفة 1-3 أيام/أسبوع
de: Leichter Sport 1-3 Tage/Woche
fr: Exercice léger 1-3 jours/semaine
hi: हल्का व्यायाम 1-3 दिन/सप्ताह
it: Esercizio leggero 1-3 giorni/settimana
ja: 週1-3日の軽い運動
ko: 주 1-3일 가벼운 운동
pt: Exercício leve 1-3 dias/semana
ru: Лёгкие упражнения 1-3 дня/неделю
zh: 每周轻度运动1-3天

# activityModerate
source: Moderate
ar: معتدل
de: Moderat
fr: Modéré
hi: मध्यम
it: Moderato
ja: 中程度
ko: 보통
pt: Moderado
ru: Умеренный
zh: 中度

# activityModerateDesc
source: Moderate exercise 3-5 days/week
ar: تمارين معتدلة 3-5 أيام/أسبوع
de: Moderater Sport 3-5 Tage/Woche
fr: Exercice modéré 3-5 jours/semaine
hi: मध्यम व्यायाम 3-5 दिन/सप्ताह
it: Esercizio moderato 3-5 giorni/settimana
ja: 週3-5日の中程度の運動
ko: 주 3-5일 보통 운동
pt: Exercício moderado 3-5 dias/semana
ru: Умеренные упражнения 3-5 дней/неделю
zh: 每周中度运动3-5天

# activityHeavy
source: Heavy
ar: مكثف
de: Intensiv
fr: Intense
hi: भारी
it: Intenso
ja: 激しい
ko: 격렬한
pt: Pesado
ru: Интенсивный
zh: 重度

# activityHeavyDesc
source: Intense exercise 6-7 days/week
ar: تمارين مكثفة 6-7 أيام/أسبوع
de: Intensiver Sport 6-7 Tage/Woche
fr: Exercice intense 6-7 jours/semaine
hi: तीव्र व्यायाम 6-7 दिन/सप्ताह
it: Esercizio intenso 6-7 giorni/settimana
ja: 週6-7日の激しい運動
ko: 주 6-7일 격렬한 운동
pt: Exercício intenso 6-7 dias/semana
ru: Интенсивные упражнения 6-7 дней/неделю
zh: 每周高强度运动6-7天

# activityAthlete
source: Athlete
ar: رياضي
de: Athlet
fr: Athlète
hi: एथलीट
it: Atleta
ja: アスリート
ko: 운동선수
pt: Atleta
ru: Атлет
zh: 运动员

# activityAthleteDesc
source: Very intense exercise, physical work
ar: تمارين مكثفة جداً، عمل بدني
de: Sehr intensiver Sport, körperliche Arbeit
fr: Exercice très intense, travail physique
hi: बहुत तीव्र व्यायाम, शारीरिक काम
it: Esercizio molto intenso, lavoro fisico
ja: 非常に激しい運動、肉体労働
ko: 매우 격렬한 운동, 육체 노동
pt: Exercício muito intenso, trabalho físico
ru: Очень интенсивные упражнения, физическая работа
zh: 非常高强度运动，体力劳动

# goalSelectorTitle
source: Your Main Goal
ar: هدفك الرئيسي
de: Dein Hauptziel
fr: Votre Objectif Principal
hi: आपका मुख्य लक्ष्य
it: Il Tuo Obiettivo Principale
ja: 主な目標
ko: 주요 목표
pt: Seu Objetivo Principal
ru: Твоя главная цель
zh: 你的主要目标

# goalLose
source: Lose Weight
ar: خسارة الوزن
de: Abnehmen
fr: Perdre du Poids
hi: वजन कम करें
it: Perdere Peso
ja: 減量
ko: 체중 감량
pt: Perder Peso
ru: Похудеть
zh: 减重

# goalLoseDesc
source: Caloric deficit of 500 kcal/day
ar: عجز سعرات 500 سعرة/يوم
de: Kaloriendefizit von 500 kcal/Tag
fr: Déficit calorique de 500 kcal/jour
hi: 500 kcal/दिन कैलोरी कमी
it: Deficit calorico di 500 kcal/giorno
ja: 1日500kcalのカロリー不足
ko: 하루 500kcal 칼로리 결손
pt: Déficit calórico de 500 kcal/dia
ru: Дефицит калорий 500 ккал/день
zh: 每天热量赤字500千卡

# goalMaintain
source: Maintain Weight
ar: الحفاظ على الوزن
de: Gewicht Halten
fr: Maintenir le Poids
hi: वजन बनाए रखें
it: Mantenere Peso
ja: 体重維持
ko: 체중 유지
pt: Manter Peso
ru: Поддерживать вес
zh: 保持体重

# goalMaintainDesc
source: Maintenance diet
ar: نظام غذائي للمحافظة
de: Erhaltungsdiät
fr: Régime de maintien
hi: रखरखाव आहार
it: Dieta di mantenimento
ja: 維持食
ko: 유지 식단
pt: Dieta de manutenção
ru: Поддерживающая диета
zh: 维持饮食

# goalGain
source: Build Muscle
ar: بناء العضلات
de: Muskeln Aufbauen
fr: Prendre de la Masse
hi: मांसपेशियां बढ़ाएं
it: Aumentare Massa
ja: 筋肉増量
ko: 근육 증가
pt: Ganhar Massa
ru: Набрать массу
zh: 增肌

# goalGainDesc
source: Caloric surplus of 300 kcal/day
ar: فائض سعرات 300 سعرة/يوم
de: Kalorienüberschuss von 300 kcal/Tag
fr: Surplus calorique de 300 kcal/jour
hi: 300 kcal/दिन कैलोरी अधिशेष
it: Surplus calorico di 300 kcal/giorno
ja: 1日300kcalのカロリー過剰
ko: 하루 300kcal 칼로리 잉여
pt: Superávit calórico de 300 kcal/dia
ru: Избыток калорий 300 ккал/день
zh: 每天热量盈余300千卡

# dailySummaryTitle
source: Daily Summary
ar: الملخص اليومي
de: Tageszusammenfassung
fr: Résumé Quotidien
hi: दैनिक सारांश
it: Riepilogo Giornaliero
ja: 本日のまとめ
ko: 일일 요약
pt: Resumo Diário
ru: Дневная сводка
zh: 每日摘要

# dailySummaryCalories
source: Calories
ar: السعرات
de: Kalorien
hi: कैलोरी
it: Calorie
ja: カロリー
ko: 칼로리
pt: Calorias
ru: Калории
zh: 卡路里

# dailySummaryProtein
source: Protein
ar: البروتين
fr: Protéines
hi: प्रोटीन
it: Proteine
ja: タンパク質
ko: 단백질
pt: Proteína
ru: Белок
zh: 蛋白质

# dailySummaryCarbs
source: Carbs
ar: الكربوهيدرات
de: Kohlenhydrate
fr: Glucides
hi: कार्बोहाइड्रेट
it: Carboidrati
ja: 炭水化物
ko: 탄수화물
pt: Carboidratos
ru: Углеводы
zh: 碳水化合物

# dailySummaryFat
source: Fat
ar: الدهون
de: Fett
fr: Lipides
hi: वसा
it: Grassi
ja: 脂質
ko: 지방
pt: Gordura
ru: Жиры
zh: 脂肪

# dailySummaryLeft
source: Left
ar: المتبقي
de: Übrig
fr: Restant
hi: बचा हुआ
it: Rimanenti
ja: 残り
ko: 남음
pt: Restante
ru: Осталось
zh: 剩余

# dailySummaryKcal
source: kcal
ar: سعرة
ru: ккал
zh: 千卡

# languageNotAvailable
source: This language is not yet available in FEEDLOG.
ar: هذه اللغة غير متوفرة بعد في FEEDLOG.
de: Diese Sprache ist noch nicht in FEEDLOG verfügbar.
fr: Cette langue n'est pas encore disponible dans FEEDLOG.
hi: यह भाषा अभी FEEDLOG में उपलब्ध नहीं है।
it: Questa lingua non è ancora disponibile in FEEDLOG.
ja: この言語はFEEDLOGではまだ利用できません。
ko: 이 언어는 아직 FEEDLOG에서 사용할 수 없습니다.
pt: Este idioma ainda não está disponível no FEEDLOG.
ru: Этот язык пока не доступен в FEEDLOG.
zh: 该语言在FEEDLOG中尚不可用。

# languageAvailableOptions
source: Available languages
ar: اللغات المتاحة
de: Verfügbare Sprachen
fr: Langues disponibles
hi: उपलब्ध भाषाएं
it: Lingue disponibili
ja: 利用可能な言語
ko: 사용 가능한 언어
pt: Idiomas disponíveis
ru: Доступные языки
zh: 可用语言

# languageChangePrompt
source: Would you like to choose a different language?
ar: هل تريد اختيار لغة مختلفة؟
de: Möchtest du eine andere Sprache wählen?
fr: Souhaitez-vous choisir une autre langue ?
hi: क्या आप कोई अन्य भाषा चुनना चाहेंगे?
it: Vorresti scegliere una lingua diversa?
ja: 他の言語を選びますか？
ko: 다른 언어를 선택하시겠어요?
pt: Você gostaria de escolher um idioma diferente?
ru: Хочешь выбрать другой язык?
zh: 你想选择其他语言吗？

# languageChangeConfirm
source: Language changed successfully! 🌍
ar: تم تغيير اللغة بنجاح! 🌍
de: Sprache erfolgreich geändert! 🌍
fr: Langue changée avec succès ! 🌍
hi: भाषा सफलतापूर्वक बदल दी गई! 🌍
it: Lingua cambiata con successo! 🌍
ja: 言語を変更しました！🌍
ko: 언어가 변경되었습니다! 🌍
pt: Idioma alterado com sucesso! 🌍
ru: Язык успешно изменён! 🌍
zh: 语言更改成功！🌍

# languageNotSupported
source: This language is not available. Available languages: {languages}
ar: هذه اللغة غير متوفرة. اللغات المتاحة: {languages}
de: Diese Sprache ist nicht verfügbar. Verfügbare Sprachen: {languages}
fr: Cette langue n'est pas disponible. Langues disponibles : {languages}
hi: यह भाषा उपलब्ध नहीं है। उपलब्ध भाषाएं: {languages}
it: Questa lingua non è disponibile. Lingue disponibili: {languages}
ja: この言語は利用できません。利用可能な言語：{languages}
ko: 이 언어는 사용할 수 없습니다. 사용 가능한 언어: {languages}
pt: Este idioma não está disponível. Idiomas disponíveis: {languages}
ru: Этот язык недоступен. Доступные языки: {languages}
zh: 该语言不可用。可用语言：{languages}

# languageChanged
source: Language changed to {language}! 🌍 From now on I'll respond in this language.
ar: تم تغيير اللغة إلى {language}! 🌍 من الآن سأرد بهذه اللغة.
de: Sprache auf {language} geändert! 🌍 Ab jetzt werde ich in dieser Sprache antworten.
fr: Langue changée en {language} ! 🌍 Désormais je répondrai dans cette langue.
hi: भाषा {language} में बदल दी गई! 🌍 अब से मैं इस भाषा में जवाब दूंगा।
it: Lingua cambiata in {language}! 🌍 D'ora in poi risponderò in questa lingua.
ja: 言語を{language}に変更しました！🌍 これからはこの言語で返信します。
ko: 언어가 {language}로 변경되었습니다! 🌍 이제 이 언어로 응답하겠습니다.
pt: Idioma alterado para {language}! 🌍 A partir de agora responderei neste idioma.
ru: Язык изменён на {language}! 🌍 Теперь я буду отвечать на этом языке.
zh: 语言已更改为{language}！🌍 从现在开始我将用这种语言回复。

# languageSelectorTitle
source: Select Language
ar: اختر اللغة
de: Sprache Auswählen
fr: Sélectionner la Langue
hi: भाषा चुनें
it: Seleziona Lingua
ja: 言語を選択
ko: 언어 선택
pt: Selecione o Idioma
ru: Выберите язык
zh: 选择语言

# languageSelectorPrompt
source: Here are the available languages. Select the one you prefer:
ar: إليك اللغات المتاحة. اختر اللغة التي تفضلها:
de: Hier sind die verfügbaren Sprachen. Wähle die gewünschte aus:
fr: Voici les langues disponibles. Sélectionnez celle que vous préférez :
hi: यहाँ उपलब्ध भाषाएं हैं। अपनी पसंदीदा भाषा चुनें:
it: Ecco le lingue disponibili. Seleziona quella che preferisci:
ja: 利用可能な言語はこちらです。お好みの言語を選択してください：
ko: 사용 가능한 언어입니다. 원하는 언어를 선택하세요:
pt: Aqui estão os idiomas disponíveis. Selecione o que você prefere:
ru: Вот доступные языки. Выберите предпочтительный:
zh: 以下是可用的语言。请选择您偏好的语言：

# onboardingLanguagePrompt
source: Welcome! 🌍 Before we begin, please select your preferred language:
ar: مرحباً! 🌍 قبل أن نبدأ، اختر لغتك المفضلة:
de: Willkommen! 🌍 Bevor wir beginnen, wähle bitte deine bevorzugte Sprache:
fr: Bienvenue ! 🌍 Avant de commencer, sélectionnez votre langue préférée :
hi: स्वागत है! 🌍 शुरू करने से पहले, अपनी पसंदीदा भाषा चुनें:
it: Benvenuto! 🌍 Prima di iniziare, seleziona la tua lingua preferita:
ja: ようこそ！🌍 始める前に、お好みの言語を選択してください：
ko: 환영합니다! 🌍 시작하기 전에 원하는 언어를 선택해 주세요:
pt: Bem-vindo! 🌍 Antes de começar, selecione seu idioma preferido:
ru: Добро пожаловать! 🌍 Прежде чем начать, выберите предпочтительный язык:
zh: 欢迎！🌍 在开始之前，请选择您偏好的语言：

# onboardingLanguageTip
source: 💡 **Tip:** You can change the language anytime by asking 'which languages are available?' or saying 'change to [language]'.
ar: 💡 **نصيحة:** يمكنك تغيير اللغة في أي وقت بسؤال 'ما هي اللغات المتاحة؟' أو قول 'غيّر إلى [اللغة]'.
de: 💡 **Tipp:** Du kannst die Sprache jederzeit ändern, indem du fragst 'welche Sprachen sind verfügbar?' oder sagst 'auf [Sprache] wechseln'.
fr: 💡 **Astuce :** Vous pouvez changer la langue à tout moment en demandant 'quelles langues sont disponibles ?' ou en disant 'changer en [langue]'.
hi: 💡 **सुझाव:** आप 'कौन सी भाषाएं उपलब्ध हैं?' पूछकर या '[भाषा] में बदलें' कहकर किसी भी समय भाषा बदल सकते हैं।
it: 💡 **Suggerimento:** Puoi cambiare la lingua in qualsiasi momento chiedendo 'quali lingue sono disponibili?' o dicendo 'cambia in [lingua]'.
ja: 💡 **ヒント：** 「どの言語が使えますか？」と聞くか、「[言語]に変更して」と言うことで、いつでも言語を変更できます。
ko: 💡 **팁:** '어떤 언어를 사용할 수 있나요?'라고 묻거나 '[언어]로 변경해 줘'라고 말하면 언제든지 언어를 변경할 수 있습니다.
pt: 💡 **Dica:** Você pode mudar o idioma a qualquer momento perguntando 'quais idiomas disponíveis?' ou dizendo 'mude para [idioma]'.
ru: 💡 **Совет:** Вы можете изменить язык в любое время, спросив 'какие языки доступны?' или сказав 'сменить на [язык]'.
zh: 💡 **提示：** 您可以随时通过询问'有哪些语言可用？'或说'切换到[语言]'来更改语言。
