Repository: Julian0s/FEEDLOG-new
Catalog: lib/l10n/app_*.arb
Languages: ar, de, fr, hi, it, ja, ko, pt, ru, zh

# confirmButton
source: Confirm
ar: تأكيد
de: Bestätigen
fr: Confirmer
hi: पुष्टि करें
it: Conferma
ja: 確認
ko: 확인
pt: Confirmar
ru: Подтвердить
zh: 确认

# loadingText
source: Loading...
ar: جاري التحميل...
de: Laden...
fr: Chargement...
hi: लोड हो रहा है...
it: Caricamento...
ja: 読み込み中...
ko: 로딩 중...
pt: Carregando...
ru: Загрузка...
zh: 加载中...

# onboardingWelcomeMessage
source: Hello! 👋 Welcome to FEEDLOG! I'm your AI-powered nutrition assistant, and I'm excited to help you achieve your health goals! Let's complete your profile so I can provide you with the best possible support.|||What would you like to be called?
ar: مرحباً! 👋 أهلاً بك في FEEDLOG! أنا مساعدك الغذائي بالذكاء الاصطناعي، وأنا سعيد بمساعدتك في تحقيق أهدافك الصحية! دعنا نكمل ملفك الشخصي حتى أتمكن من تقديم أفضل دعم لك.|||ماذا تريد أن أناديك؟
de: Hallo! 👋 Willkommen bei FEEDLOG! Ich bin dein KI-gestützter Ernährungsassistent und freue mich, dir bei deinen Gesundheitszielen zu helfen! Lass uns jetzt dein Profil vervollständigen, damit ich dir die bestmögliche Unterstützung bieten kann.|||Wie möchtest du genannt werden?
fr: Bonjour ! 👋 Bienvenue sur FEEDLOG ! Je suis votre assistant nutrition alimenté par l'intelligence artificielle, et je suis ravi de vous aider à atteindre vos objectifs de santé ! Complétons maintenant votre profil pour que je puisse vous offrir le meilleur suivi possible.|||Comment aimeriez-vous être appelé ?
hi: नमस्ते! 👋 FEEDLOG में आपका स्वागत है! मैं आपका AI पोषण सहायक हूं, और मैं आपके स्वास्थ्य लक्ष्यों को प्राप्त करने में आपकी मदद करने के लिए उत्साहित हूं! आइए आपकी प्रोफाइल पूरी करें ताकि मैं आपको सबसे अच्छा समर्थन दे सकूं।|||आप क्या बुलाना पसंद करेंगे?
it: Ciao! 👋 Benvenuto su FEEDLOG! Sono il tuo assistente nutrizionale con intelligenza artificiale, e sono entusiasta di aiutarti a raggiungere i tuoi obiettivi di salute! Ora completiamo il tuo profilo così posso offrirti il miglior supporto possibile.|||Come vorresti essere chiamato?
ja: こんにちは！👋 FEEDLOGへようこそ！私はあなたのAI栄養アシスタントです。あなたの健康目標達成をお手伝いできることを嬉しく思います！ プロフィールを完成させて、最高のサポートを提供できるようにしましょう。|||何とお呼びすればよいですか？
ko: 안녕하세요! 👋 FEEDLOG에 오신 것을 환영합니다! 저는 AI 영양 도우미이며, 건강 목표 달성을 도와드리게 되어 기쁩니다! 최고의 지원을 제공할 수 있도록 프로필을 완성해 봅시다.|||뭐라고 불러드릴까요?
pt: Olá! 👋 Seja muito bem-vindo ao FEEDLOG! Eu sou seu assistente de nutrição com inteligência artificial, e estou muito animado para te ajudar a alcançar seus objetivos de saúde! A partir de agora, vamos completar seu cadastro para que eu possa te oferecer o melhor acompanhamento possível.|||Como você gostaria de ser chamado?
ru: Привет! 👋 Добро пожаловать в FEEDLOG! Я твой ИИ-помощник по питанию, и я рад помочь тебе достичь твоих целей здоровья! Давай заполним твой профиль, чтобы я мог предоставить тебе лучшую поддержку.|||Как бы ты хотел, чтобы я тебя называл?
zh: 你好！👋 欢迎来到FEEDLOG！我是你的AI营养助手，很高兴能帮助你实现健康目标！ 现在让我们完成你的个人资料，这样我就能为你提供最好的支持。|||你希望我怎么称呼你？

# onboardingNameConfirmation
source: Nice to meet you, {name}! 😊 Now I need to know your biological sex to accurately calculate your nutritional profile.
ar: سعيد بلقائك، {name}! 😊 الآن أحتاج لمعرفة جنسك البيولوجي لحساب ملفك الغذائي بدقة.
de: Freut mich, dich kennenzulernen, {name}! 😊 Jetzt brauche ich dein biologisches Geschlecht, um dein Ernährungsprofil genau zu berechnen.
fr: Ravi de vous rencontrer, {name} ! 😊 Maintenant, j'ai besoin de connaître votre sexe biologique pour calculer votre profil nutritionnel avec précision.
hi: आपसे मिलकर खुशी हुई, {name}! 😊 अब मुझे आपका जैविक लिंग जानना होगा ताकि आपकी पोषण प्रोफाइल सटीक रूप से गणना कर सकूं।
it: Piacere di conoscerti, {name}! 😊 Ora ho bisogno di sapere il tuo sesso biologico per calcolare il tuo profilo nutrizionale con precisione.
ja: はじめまして、{name}さん！😊 栄養プロフィールを正確に計算するために、生物学的性別を教えてください。
ko: 만나서 반갑습니다, {name}님! 😊 이제 영양 프로필을 정확하게 계산하기 위해 생물학적 성별을 알아야 합니다.
pt: Prazer em te conhecer, {name}! 😊 Agora preciso saber seu sexo biológico para calcular seu perfil nutricional com precisão.
ru: Приятно познакомиться, {name}! 😊 Теперь мне нужно узнать твой биологический пол для точного расчёта твоего нутриционного профиля.
zh: 很高兴认识你，{name}！😊 现在我需要知道你的生理性别，以便准确计算你的营养档案。

# onboardingGenderPrompt
source: Perfect, {name}! 😊 To calculate your nutritional profile accurately, I need to know your biological sex. WIDGET:gender_selector
ar: ممتاز، {name}! 😊 لحساب ملفك الغذائي بدقة، أحتاج لمعرفة جنسك البيولوجي. WIDGET:gender_selector
de: Perfekt, {name}! 😊 Um dein Ernährungsprofil genau zu berechnen, muss ich dein biologisches Geschlecht wissen. WIDGET:gender_selector
fr: Parfait, {name} ! 😊 Pour calculer votre profil nutritionnel avec précision, j'ai besoin de connaître votre sexe biologique. WIDGET:gender_selector
hi: बहुत अच्छा, {name}! 😊 आपकी पोषण प्रोफाइल की सटीक गणना के लिए, मुझे आपका जैविक लिंग जानना होगा। WIDGET:gender_selector
it: Perfetto, {name}! 😊 Per calcolare il tuo profilo nutrizionale con precisione, ho bisogno di sapere il tuo sesso biologico. WIDGET:gender_selector
ja: 完璧です、{name}さん！😊 栄養プロフィールを正確に計算するために、生物学的性別を知る必要があります。WIDGET:gender_selector
ko: 완벽해요, {name}님! 😊 영양 프로필을 정확하게 계산하기 위해 생물학적 성별을 알아야 합니다. WIDGET:gender_selector
pt: Perfeito, {name}! 😊 Para calcular seu perfil nutricional com precisão, preciso saber seu sexo biológico. WIDGET:gender_selector
ru: Отлично, {name}! 😊 Для точного расчёта твоего нутриционного профиля мне нужно знать твой биологический пол. WIDGET:gender_selector
zh: 太好了，{name}！😊 为了准确计算你的营养档案，我需要知道你的生理性别。WIDGET:gender_selector

# onboardingAgePrompt
source: Great! Now tell me: how old are you?
ar: رائع! الآن أخبرني: كم عمرك؟
de: Toll! Jetzt sag mir: wie alt bist du?
fr: Génial ! Maintenant dites-moi : quel âge avez-vous ?
hi: बढ़िया! अब मुझे बताएं: आपकी उम्र क्या है?
it: Ottimo! Ora dimmi: quanti anni hai?
ja: 素晴らしい！何歳ですか？
ko: 좋아요! 이제 말씀해 주세요: 몇 살이신가요?
pt: Ótimo! Agora me diz: quantos anos você tem?
ru: Супер! Теперь скажи мне: сколько тебе лет?
zh: 太棒了！现在告诉我：你多大了？

# onboardingHeightPrompt
source: Perfect! And what's your height? (you can use meters or centimeters)
ar: ممتاز! وما هو طولك؟ (بالأمتار أو السنتيمترات)
de: Perfekt! Und wie groß bist du? (in Metern oder Zentimetern)
fr: Parfait ! Et quelle est votre taille ? (en mètres ou centimètres)
hi: परफेक्ट! और आपकी ऊंचाई क्या है? (मीटर या सेंटीमीटर में)
it: Perfetto! E qual è la tua altezza? (in metri o centimetri)
ja: 完璧！身長はどのくらいですか？（メートルまたはセンチメートルで）
ko: 완벽해요! 키는 얼마인가요? (미터 또는 센티미터로)
pt: Perfeito! E qual é sua altura? (pode ser em metros ou centímetros)
ru: Отлично! А какой у тебя рост? (можно в метрах или сантиметрах)
zh: 很好！你的身高是多少？（可以用米或厘米）

# onboardingWeightPrompt
source: Got it! Now tell me: what's your current weight?
ar: فهمت! الآن أخبرني: ما هو وزنك الحالي؟
de: Verstanden! Jetzt sag mir: wie viel wiegst du aktuell?
fr: Compris ! Maintenant dites-moi : quel est votre poids actuel ?
hi: समझ गया! अब बताएं: आपका वर्तमान वजन क्या है?
it: Capito! Ora dimmi: qual è il tuo peso attuale?
ja: わかりました！現在の体重は何キロですか？
ko: 알겠어요! 이제 말씀해 주세요: 현재 체중은 얼마인가요?
pt: Entendi! Agora me conta: qual é seu peso atual?
ru: Понял! Теперь скажи: какой у тебя текущий вес?
zh: 明白了！现在告诉我：你目前的体重是多少？

# onboardingTargetWeightPrompt
source: Noted! And what's your target weight? (the weight you want to reach)
ar: تم التسجيل! وما هو وزنك المستهدف؟ (الوزن الذي تريد الوصول إليه)
de: Notiert! Und was ist dein Zielgewicht? (das Gewicht, das du erreichen möchtest)
fr: Noté ! Et quel est votre poids cible ? (le poids que vous souhaitez atteindre)
hi: नोट कर लिया! और आपका लक्ष्य वजन क्या है? (वह वजन जो आप पाना चाहते हैं)
it: Annotato! E qual è il tuo peso obiettivo? (il peso che vuoi raggiungere)
ja: メモしました！目標体重は何キロですか？（達成したい体重）
ko: 기록했어요! 목표 체중은 얼마인가요? (달성하고 싶은 체중)
pt: Anotado! E qual é seu peso alvo? (o peso que você quer atingir)
ru: Записал! А какой твой целевой вес? (вес, которого ты хочешь достичь)
zh: 记下了！你的目标体重是多少？（你想达到的体重）

# onboardingActivityPrompt
source: To calculate your calorie expenditure, I need to know: what's your daily physical activity level? WIDGET:activity_selector
ar: لحساب استهلاكك للسعرات الحرارية، أحتاج لمعرفة: ما هو مستوى نشاطك البدني اليومي؟ WIDGET:activity_selector
de: Um deinen Kalorienverbrauch zu berechnen, muss ich wissen: wie ist dein tägliches Aktivitätsniveau? WIDGET:activity_selector
fr: Pour calculer votre dépense calorique, j'ai besoin de savoir : quel est votre niveau d'activité physique quotidien ? WIDGET:activity_selector
hi: आपकी कैलोरी खपत की गणना के लिए, मुझे जानना होगा: आपकी दैनिक शारीरिक गतिविधि का स्तर क्या है? WIDGET:activity_selector
it: Per calcolare il tuo dispendio calorico, ho bisogno di sapere: qual è il tuo livello di attività fisica quotidiano? WIDGET:activity_selector
ja: カロリー消費量を計算するために、日々の身体活動レベルを教えてください。 WIDGET:activity_selector
ko: 칼로리 소비량을 계산하기 위해 알아야 합니다: 일상적인 신체 활동 수준은 어떤가요? WIDGET:activity_selector
pt: Para calcular seu gasto calórico, preciso saber: como é seu nível de atividade física no dia a dia? WIDGET:activity_selector
ru: Чтобы рассчитать твой расход калорий, мне нужно знать: каков твой уровень физической активности в повседневной жизни? WIDGET:activity_selector
zh: 为了计算你的卡路里消耗，我需要知道：你每天的身体活动水平如何？ WIDGET:activity_selector

# onboardingGoalPrompt
source: Great! Last question: what's your main goal? WIDGET:goal_selector
ar: رائع! سؤال أخير: ما هو هدفك الرئيسي؟ WIDGET:goal_selector
de: Toll! Letzte Frage: was ist dein Hauptziel? WIDGET:goal_selector
fr: Génial ! Dernière question : quel est votre objectif principal ? WIDGET:goal_selector
hi: बढ़िया! अंतिम प्रश्न: आपका मुख्य लक्ष्य क्या है? WIDGET:goal_selector
it: Ottimo! Ultima domanda: qual è il tuo obiettivo principale? WIDGET:goal_selector
ja: 素晴らしい！最後の質問です：主な目標は何ですか？ WIDGET:goal_selector
ko: 좋아요! 마지막 질문: 주요 목표는 무엇인가요? WIDGET:goal_selector
pt: Ótimo! Última pergunta: qual é seu objetivo principal? WIDGET:goal_selector
ru: Супер! Последний вопрос: какая твоя главная цель? WIDGET:goal_selector
zh: 太棒了！最后一个问题：你的主要目标是什么？ WIDGET:goal_selector

# onboardingResultsMessage
source: 🎉 Profile complete, {name}! I've calculated your nutritional profile: • TDEE: {tdee} kcal/day • Daily target: {dailyCalories} kcal • Protein: {protein}g • Carbohydrates: {carbs}g • Fat: {fat}g Now let me show you how to use FEEDLOG!
ar: 🎉 اكتمل الملف، {name}! لقد حسبت ملفك الغذائي: • TDEE: {tdee} سعرة/يوم • الهدف اليومي: {dailyCalories} سعرة • البروتين: {protein}غ • الكربوهيدرات: {carbs}غ • الدهون: {fat}غ الآن سأريك كيف تستخدم FEEDLOG!
de: 🎉 Profil vollständig, {name}! Ich habe dein Ernährungsprofil berechnet: • TDEE: {tdee} kcal/Tag • Tagesziel: {dailyCalories} kcal • Protein: {protein}g • Kohlenhydrate: {carbs}g • Fett: {fat}g Jetzt zeige ich dir, wie FEEDLOG funktioniert!
fr: 🎉 Profil complet, {name} ! J'ai calculé votre profil nutritionnel : • TDEE : {tdee} kcal/jour • Objectif quotidien : {dailyCalories} kcal • Protéines : {protein}g • Glucides : {carbs}g • Lipides : {fat}g Maintenant, je vais vous montrer comment utiliser FEEDLOG !
hi: 🎉 प्रोफाइल पूरी, {name}! मैंने आपकी पोषण प्रोफाइल की गणना की: • TDEE: {tdee} kcal/दिन • दैनिक लक्ष्य: {dailyCalories} kcal • प्रोटीन: {protein}g • कार्बोहाइड्रेट: {carbs}g • वसा: {fat}g अब मैं आपको FEEDLOG का उपयोग करना सिखाऊंगा!
it: 🎉 Profilo completo, {name}! Ho calcolato il tuo profilo nutrizionale: • TDEE: {tdee} kcal/giorno • Obiettivo giornaliero: {dailyCalories} kcal • Proteine: {protein}g • Carboidrati: {carbs}g • Grassi: {fat}g Ora ti mostro come usare FEEDLOG!
ja: 🎉 プロフィール完成、{name}さん！ 栄養プロフィールを計算しました： • TDEE：{tdee} kcal/日 • 日々の目標：{dailyCalories} kcal • タンパク質：{protein}g • 炭水化物：{carbs}g • 脂質：{fat}g FEEDLOGの使い方をお教えします！
ko: 🎉 프로필 완성, {name}님! 영양 프로필을 계산했습니다: • TDEE: {tdee} kcal/일 • 일일 목표: {dailyCalories} kcal • 단백질: {protein}g • 탄수화물: {carbs}g • 지방: {fat}g 이제 FEEDLOG 사용법을 알려드릴게요!
pt: 🎉 Cadastro completo, {name}! Calculei seu perfil nutricional: • TDEE: {tdee} kcal/dia • Meta diária: {dailyCalories} kcal • Proteína: {protein}g • Carboidratos: {carbs}g • Gordura: {fat}g Agora vou te ensinar como usar o FEEDLOG!
ru: 🎉 Профиль готов, {name}! Я рассчитал твой нутриционный профиль: • TDEE: {tdee} ккал/день • Дневная цель: {dailyCalories} ккал • Белок: {protein}г • Углеводы: {carbs}г • Жиры: {fat}г Теперь покажу, как пользоваться FEEDLOG!
zh: 🎉 资料完成，{name}！ 我已经计算了你的营养档案： • TDEE：{tdee} 千卡/天 • 每日目标：{dailyCalories} 千卡 • 蛋白质：{protein}g • 碳水化合物：{carbs}g • 脂肪：{fat}g 现在让我教你如何使用FEEDLOG！

# onboardingTutorialMessage
source: 📱 How FEEDLOG works: 1️⃣ **Log meals**: Just tell me what you ate! Example: 'I ate 2 eggs and a banana' 2️⃣ **Track your progress**: Ask 'How many calories did I eat today?' or 'How's my day going?' 3️⃣ **Update weight**: Say 'I lost 1kg' or 'I'm at 80kg' 4️⃣ **Check foods**: Ask 'How many calories are in an apple?' Everything works by chatting with me naturally! Ready to start? 🚀
ar: 📱 كيف يعمل FEEDLOG: 1️⃣ **تسجيل الوجبات**: فقط أخبرني ماذا أكلت! مثال: 'أكلت بيضتين وموزة' 2️⃣ **متابعة التقدم**: اسأل 'كم سعرة أكلت اليوم؟' أو 'كيف يومي؟' 3️⃣ **تحديث الوزن**: قل 'خسرت 1 كغ' أو 'وزني 80 كغ' 4️⃣ **الاستعلام عن الأطعمة**: اسأل 'كم سعرة في التفاحة؟' كل شيء يعمل من خلال التحدث معي بشكل طبيعي! مستعد للبدء؟ 🚀
de: 📱 So funktioniert FEEDLOG: 1️⃣ **Mahlzeiten erfassen**: Erzähl mir einfach, was du gegessen hast! Beispiel: 'Ich habe 2 Eier und eine Banane gegessen' 2️⃣ **Fortschritt sehen**: Frag 'Wie viele Kalorien habe ich heute gegessen?' oder 'Wie läuft mein Tag?' 3️⃣ **Gewicht aktualisieren**: Sag 'Ich habe 1kg abgenommen' oder 'Ich wiege 80kg' 4️⃣ **Lebensmittel prüfen**: Frag 'Wie viele Kalorien hat ein Apfel?' Alles funktioniert durch natürliches Chatten mit mir! Bereit loszulegen? 🚀
fr: 📱 Comment fonctionne FEEDLOG : 1️⃣ **Enregistrer les repas** : Dites-moi simplement ce que vous avez mangé ! Exemple : 'J'ai mangé 2 œufs et une banane' 2️⃣ **Voir vos progrès** : Demandez 'Combien de calories ai-je mangé aujourd'hui ?' ou 'Comment va ma journée ?' 3️⃣ **Mettre à jour le poids** : Dites 'J'ai perdu 1kg' ou 'Je pèse 80kg' 4️⃣ **Consulter les aliments** : Demandez 'Combien de calories dans une pomme ?' Tout fonctionne en discutant naturellement avec moi ! Prêt à commencer ? 🚀
hi: 📱 FEEDLOG कैसे काम करता है: 1️⃣ **भोजन रिकॉर्ड करें**: बस मुझे बताएं आपने क्या खाया! उदाहरण: 'मैंने 2 अंडे और एक केला खाया' 2️⃣ **प्रगति देखें**: पूछें 'आज मैंने कितनी कैलोरी खाई?' या 'मेरा दिन कैसा है?' 3️⃣ **वजन अपडेट करें**: कहें 'मेरा 1kg कम हुआ' या 'मेरा वजन 80kg है' 4️⃣ **भोजन जानकारी**: पूछें 'एक सेब में कितनी कैलोरी हैं?' सब कुछ स्वाभाविक बातचीत से काम करता है! शुरू करने के लिए तैयार हैं? 🚀
it: 📱 Come funziona FEEDLOG: 1️⃣ **Registrare pasti**: Dimmi semplicemente cosa hai mangiato! Esempio: 'Ho mangiato 2 uova e una banana' 2️⃣ **Vedere i progressi**: Chiedi 'Quante calorie ho mangiato oggi?' o 'Come va la mia giornata?' 3️⃣ **Aggiornare peso**: Di' 'Ho perso 1kg' o 'Peso 80kg' 4️⃣ **Consultare alimenti**: Chiedi 'Quante calorie ha una mela?' Tutto funziona chattando naturalmente con me! Pronti a iniziare? 🚀
ja: 📱 FEEDLOGの使い方： 1️⃣ **食事を記録**：食べたものを教えてください！例：「卵2個とバナナを食べました」 2️⃣ **進捗を確認**：「今日何カロリー食べた？」や「今日はどう？」と聞いてください 3️⃣ **体重を更新**：「1kg減った」や「80kgです」と言ってください 4️⃣ **食品を調べる**：「りんごは何カロリー？」と聞いてください 自然な会話ですべてが機能します！始める準備はできましたか？🚀
ko: 📱 FEEDLOG 사용법: 1️⃣ **식사 기록**: 뭘 먹었는지 말씀해 주세요! 예: '달걀 2개와 바나나를 먹었어요' 2️⃣ **진행 상황 확인**: '오늘 몇 칼로리 먹었어?' 또는 '오늘 어때?'라고 물어보세요 3️⃣ **체중 업데이트**: '1kg 빠졌어' 또는 '80kg이야'라고 말씀하세요 4️⃣ **음식 조회**: '사과는 몇 칼로리야?'라고 물어보세요 모든 것이 자연스러운 대화로 작동합니다! 시작할 준비됐나요? 🚀
pt: 📱 Como funciona o FEEDLOG: 1️⃣ **Registrar refeições**: Basta me contar o que comeu! Exemplo: 'Comi 2 ovos e uma banana' 2️⃣ **Ver seu progresso**: Pergunte 'Quantas calorias comi hoje?' ou 'Como está meu dia?' 3️⃣ **Atualizar peso**: Diga 'Perdi 1kg' ou 'Estou com 80kg' 4️⃣ **Consultar alimentos**: Pergunte 'Quantas calorias tem uma maçã?' Tudo funciona conversando comigo naturalmente! Estamos prontos para começar? 🚀
ru: 📱 Как работает FEEDLOG: 1️⃣ **Записывать приёмы пищи**: Просто расскажи, что ты съел! Пример: 'Я съел 2 яйца и банан' 2️⃣ **Смотреть прогресс**: Спроси 'Сколько калорий я съел сегодня?' или 'Как мой день?' 3️⃣ **Обновлять вес**: Скажи 'Я похудел на 1кг' или 'Я вешу 80кг' 4️⃣ **Узнавать о продуктах**: Спроси 'Сколько калорий в яблоке?' Всё работает через естественное общение со мной! Готов начать? 🚀
zh: 📱 FEEDLOG使用方法： 1️⃣ **记录餐食**：只需告诉我你吃了什么！例如：'我吃了2个鸡蛋和一根香蕉' 2️⃣ **查看进度**：问'我今天吃了多少卡路里？'或'我今天怎么样？' 3️⃣ **更新体重**：说'我减了1公斤'或'我现在80公斤' 4️⃣ **查询食物**：问'一个苹果有多少卡路里？' 一切都通过自然聊天来完成！准备好开始了吗？🚀

# chatWelcomeBack
source: Welcome back! What did you eat today?
ar: أهلاً بعودتك! ماذا أكلت اليوم؟
de: Willkommen zurück! Was hast du heute gegessen?
fr: Bon retour ! Qu'avez-vous mangé aujourd'hui ?
hi: वापसी पर स्वागत है! आज आपने क्या खाया?
it: Bentornato! Cosa hai mangiato oggi?
ja: おかえりなさい！今日は何を食べましたか？
ko: 돌아오셨네요! 오늘 뭘 드셨나요?
pt: Bem-vindo de volta! O que você comeu hoje?
ru: С возвращением! Что ты ел сегодня?
zh: 欢迎回来！你今天吃了什么？

# chatNameError
source: Sorry, I couldn't identify your name. Could you just type what you'd like to be called?
ar: عذراً، لم أتمكن من تحديد اسمك. هل يمكنك كتابة ماذا تريد أن أناديك فقط؟
de: Entschuldigung, ich konnte deinen Namen nicht erkennen. Könntest du einfach schreiben, wie du genannt werden möchtest?
fr: Désolé, je n'ai pas pu identifier votre nom. Pourriez-vous simplement écrire comment vous souhaitez être appelé ?
hi: क्षमा करें, मैं आपका नाम पहचान नहीं पाया। क्या आप बस लिख सकते हैं कि आप क्या बुलाना चाहते हैं?
it: Scusa, non sono riuscito a identificare il tuo nome. Potresti scrivere semplicemente come vuoi essere chiamato?
ja: すみません、お名前を認識できませんでした。どう呼ばれたいか教えていただけますか？
ko: 죄송해요, 이름을 인식하지 못했어요. 뭐라고 불러드릴지 적어주시겠어요?
pt: Desculpe, não consegui identificar seu nome. Poderia digitar apenas como quer ser chamado?
ru: Извини, я не смог распознать твоё имя. Можешь просто написать, как тебя называть?
zh: 抱歉，我无法识别你的名字。你能直接告诉我你想被怎么称呼吗？

# chatAgeConfirmation
source: {age} years old, noted! ✅
ar: {age} سنة، تم التسجيل! ✅
de: {age} Jahre alt, notiert! ✅
fr: {age} ans, noté ! ✅
hi: {age} साल, नोट कर लिया! ✅
it: {age} anni, annotato! ✅
ja: {age}歳、メモしました！✅
ko: {age}세, 기록했어요! ✅
pt: {age} anos, anotado! ✅
ru: {age} лет, записал! ✅
zh: {age}岁，记下了！✅

# chatAgeError
source: Please enter a valid age (e.g., 30).
ar: الرجاء إدخال عمر صحيح (مثال: 30).
de: Bitte gib ein gültiges Alter ein (z.B. 30).
fr: Veuillez entrer un âge valide (ex : 30).
hi: कृपया एक वैध उम्र दर्ज करें (उदाहरण: 30)।
it: Per favore, inserisci un'età valida (es: 30).
ja: 有効な年齢を入力してください（例：30）。
ko: 유효한 나이를 입력해 주세요 (예: 30).
pt: Por favor, digite uma idade válida (ex: 30).
ru: Пожалуйста, введи корректный возраст (например: 30).
zh: 请输入有效的年龄（例如：30）。

# chatHeightConfirmation
source: {height}m tall, great! ✅
ar: {height}م، رائع! ✅
de: {height}m groß, toll! ✅
fr: {height}m, génial ! ✅
hi: {height}मी, बढ़िया! ✅
it: {height}m di altezza, ottimo! ✅
ja: {height}m、素晴らしい！✅
ko: {height}m, 좋아요! ✅
pt: {height}m de altura, ótimo! ✅
ru: {height}м роста, супер! ✅
zh: {height}米，太棒了！✅

# chatHeightError
source: I didn't understand the height. Try something like '1.75' or '175cm'.
ar: لم أفهم الطول. جرب شيئاً مثل '1.75' أو '175سم'.
de: Die Größe habe ich nicht verstanden. Versuche etwas wie '1.75' oder '175cm'.
fr: Je n'ai pas compris la taille. Essayez quelque chose comme '1.75' ou '175cm'.
hi: ऊंचाई समझ नहीं आई। '1.75' या '175cm' जैसा कुछ आज़माएं।
it: Non ho capito l'altezza. Prova qualcosa come '1.75' o '175cm'.
ja: 身長がわかりませんでした。「1.75」や「175cm」のように入力してみてください。
ko: 키를 이해하지 못했어요. '1.75' 또는 '175cm' 같이 입력해 보세요.
pt: Não entendi a altura. Tente algo como '1.75' ou '175cm'.
ru: Не понял рост. Попробуй что-то вроде '1.75' или '175см'.
zh: 我不太理解身高。试试像'1.75'或'175cm'这样的格式。

# chatWeightConfirmation
source: {weight}kg registered! ✅
ar: {weight} كغ تم التسجيل! ✅
de: {weight}kg registriert! ✅
fr: {weight}kg enregistré ! ✅
hi: {weight}kg रिकॉर्ड किया! ✅
it: {weight}kg registrato! ✅
ja: {weight}kg記録しました！✅
ko: {weight}kg 기록됨! ✅
pt: {weight}kg registrado! ✅
ru: {weight}кг записано! ✅
zh: {weight}公斤已记录！✅

# chatWeightError
source: I didn't understand the weight. Try something like '80kg'.
ar: لم أفهم الوزن. جرب شيئاً مثل '80كغ'.
de: Das Gewicht habe ich nicht verstanden. Versuche etwas wie '80kg'.
fr: Je n'ai pas compris le poids. Essayez quelque chose comme '80kg'.
hi: वजन समझ नहीं आया। '80kg' जैसा कुछ आज़माएं।
it: Non ho capito il peso. Prova qualcosa come '80kg'.
ja: 体重がわかりませんでした。「80kg」のように入力してみてください。
ko: 체중을 이해하지 못했어요. '80kg' 같이 입력해 보세요.
pt: Não entendi o peso. Tente algo como '80kg'.
ru: Не понял вес. Попробуй что-то вроде '80кг'.
zh: 我不太理解体重。试试像'80kg'这样的格式。

# chatTargetWeightConfirmation
source: Target of {weight}kg set! 💪
ar: هدف {weight} كغ تم تعيينه! 💪
de: Ziel von {weight}kg gesetzt! 💪
fr: Objectif de {weight}kg défini ! 💪
hi: लक्ष्य {weight}kg सेट किया! 💪
it: Obiettivo di {weight}kg impostato! 💪
ja: 目標{weight}kg設定しました！💪
ko: 목표 {weight}kg 설정됨! 💪
pt: Meta de {weight}kg definida! 💪
ru: Цель {weight}кг установлена! 💪
zh: 目标{weight}公斤已设定！💪

# chatTargetWeightError
source: What's your target weight? E.g., '70kg'.
ar: ما هو وزنك المستهدف؟ مثال: '70كغ'.
de: Was ist dein Zielgewicht? Z.B. '70kg'.
fr: Quel est votre poids cible ? Ex : '70kg'.
hi: आपका लक्ष्य वजन क्या है? उदाहरण: '70kg'।
it: Qual è il tuo peso obiettivo? Es: '70kg'.
ja: 目標体重は何kgですか？例：「70kg」
ko: 목표 체중은 얼마인가요? 예: '70kg'.
pt: Qual é seu peso alvo? Ex: '70kg'.
ru: Какой твой целевой вес? Например: '70кг'.
zh: 你的目标体重是多少？例如：'70kg'。

# chatSelectOptionAbove
source: Please select an option above.
ar: الرجاء اختيار خيار من الأعلى.
de: Bitte wähle eine Option oben aus.
fr: Veuillez sélectionner une option ci-dessus.
hi: कृपया ऊपर से एक विकल्प चुनें।
it: Per favore, seleziona un'opzione sopra.
ja: 上のオプションから選択してください。
ko: 위에서 옵션을 선택해 주세요.
pt: Por favor, selecione uma opção acima.
ru: Пожалуйста, выбери вариант выше.
zh: 请在上方选择一个选项。

# chatGenderConfirmation
source: Noted! ✅
ar: تم التسجيل! ✅
de: Notiert! ✅
fr: Noté ! ✅
hi: नोट कर लिया! ✅
it: Annotato! ✅
ja: メモしました！✅
ko: 기록했어요! ✅
pt: Anotado! ✅
ru: Записал! ✅
zh: 记下了！✅

# chatActivityConfirmation
source: Perfect! 💪
ar: ممتاز! 💪
de: Perfekt! 💪
fr: Parfait ! 💪
hi: परफेक्ट! 💪
it: Perfetto! 💪
ja: 完璧！💪
ko: 완벽해요! 💪
pt: Perfeito! 💪
ru: Отлично! 💪
zh: 完美！💪

# chatLogoutConfirmation
source: Got it! Logging out... See you later! 👋
ar: فهمت! جاري تسجيل الخروج... إلى اللقاء! 👋
de: Verstanden! Abmeldung läuft... Bis bald! 👋
fr: Compris ! Déconnexion... À bientôt ! 👋
hi: समझ गया! लॉग आउट हो रहा है... फिर मिलेंगे! 👋
it: Capito! Disconnessione in corso... A presto! 👋
ja: わかりました！ログアウト中... またね！👋
ko: 알겠어요! 로그아웃 중... 다음에 봐요! 👋
pt: Entendido! Fazendo logout... Até logo! 👋
ru: Понял! Выхожу... До встречи! 👋
zh: 明白了！正在退出... 再见！👋

# chatProcessingError
source: Sorry, I had a problem processing your message. Please try again.
ar: عذراً، حدثت مشكلة في معالجة رسالتك. حاول مرة أخرى.
de: Entschuldigung, ich hatte ein Problem bei der Verarbeitung deiner Nachricht. Bitte versuche es erneut.
fr: Désolé, j'ai eu un problème lors du traitement de votre message. Veuillez réessayer.
hi: क्षमा करें, आपके संदेश को प्रोसेस करने में समस्या हुई। कृपया फिर से कोशिश करें।
it: Scusa, ho avuto un problema nell'elaborare il tuo messaggio. Riprova.
ja: すみません、メッセージの処理中に問題が発生しました。もう一度お試しください。
ko: 죄송해요, 메시지 처리 중 문제가 발생했어요. 다시 시도해 주세요.
pt: Desculpe, tive um problema ao processar sua mensagem. Tente novamente.
ru: Извини, возникла проблема при обработке твоего сообщения. Попробуй ещё раз.
zh: 抱歉，处理你的消息时出现了问题。请重试。

# chatImageAnalyzing
source: Analyzing your image... 📸
ar: جاري تحليل صورتك... 📸
de: Analysiere dein Bild... 📸
fr: Analyse de votre image... 📸
hi: आपकी छवि का विश्लेषण हो रहा है... 📸
it: Analizzando la tua immagine... 📸
ja: 画像を分析中... 📸
ko: 이미지 분석 중... 📸
pt: Analisando sua imagem... 📸
ru: Анализирую твоё изображение... 📸
zh: 正在分析你的图片... 📸
